#ifndef TEXTS_H
#define TEXTS_H


#include <QString>

// весь текст вынес в отдельные константы потому что захотел
const QString GREETINGS =     "Приветствую Вас, о Великий Пользователь!!!!!!!!!!!!!\n"
                              "Я - программа, которая кодирует файлы волшебным образом!\n"
                              "Если у Вас, о Великий, возникло необъяснимое бешеное желание\n"
                              "закодировать файл, то, будьте так любезны, выберите его!\n"
                              "Я с превеликим удовольствием сделаю всю грязную работу!\n";

const QString ERROR_FILE = "Обшибочка! Вы не выбрали файл :<";

const QString SUCCESSED = "Успешно выполнено! 😎";

const QString LETTERS = "Буквы вх.\tБуквы вых.\n";

#endif // TEXTS_H
